api/app/controllers/v1/events_controller.rb

  def index
    @events = Event.all.paginate(page: params[:page], per_page: 20)
---
SELECT  "events".* FROM "events" LIMIT ? OFFSET ?  [["LIMIT", 20], ["OFFSET", 0]]